# mysql and connections

In [1]:
#pip install mysql-connector-python

In [2]:
import mysql.connector
con = mysql.connector.connect(
  host="localhost",
  user="root",
  port="3306",
  passwd="Day2live@",
  database="school"
)

In [3]:
import pandas as pd

In [4]:
df = pd.read_sql_query("show tables;", con)

In [5]:
df

  Tables_in_school
0            marks
1          modules
2         students

In [6]:
df1 = pd.read_sql_query("select * from students;", con)

In [7]:
df1

  student_no    surname forename
0   20060101    Dickens  Charles
1   20060102   ApGwilym   Dafydd
2   20060103       Zola    Emile
3   20060104       Mann   Thomas
4   20060105  Stevenson   Robert

In [8]:
con.close()

In [9]:
df2 = pd.read_sql_query("select * from marks where mark > 60 ;", con)

OperationalError: MySQL Connection not available.

In [ ]:
df2

In [ ]:
df3 = pd.read_sql_query("SELECT * FROM marks ORDER BY mark ASC", con)

In [ ]:
df3

In [ ]:
con.close()

In [ ]:
df1

In [ ]:
pip install sqlalchemy

In [ ]:
import sqlalchemy
sqlalchemy.__version__

In [11]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.1-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 88 kB/s  eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-1.0.1
Note: you may need to restart the kernel to use updated packages.

In [16]:
import pandas as pd
import sqlalchemy

engine = sqlalchemy.create_engine('mysql+pymysql://root:Day2live@@localhost:3306/school')

In [26]:
df = pd.read_sql_table("students", engine)
df

  student_no    surname forename
0   20060101    Dickens  Charles
1   20060102   ApGwilym   Dafydd
2   20060103       Zola    Emile
3   20060104       Mann   Thomas
4   20060105  Stevenson   Robert

In [23]:
students = {
    'student_no' : [ 20060106 , 20060107 , 20060108 , 20060109 ],
    'surname'    : ['targgeriyan', 'doubglas', 'hobbs', 'shaw' ],
    'forename'   : ['miles', 'comma', 'tires', 'dogma']
}

In [24]:
df2 = pd.DataFrame.from_dict(students)

In [25]:
df2

   student_no      surname forename
0    20060106  targgeriyan    miles
1    20060107     doubglas    comma
2    20060108        hobbs    tires
3    20060109         shaw    dogma

In [27]:
df2.to_sql(
    name = 'students',
    con = engine,
    index= False,
    if_exists='append'
)

In [28]:
pd.read_sql_query('select * from students', engine)

  student_no      surname forename
0   20060101      Dickens  Charles
1   20060102     ApGwilym   Dafydd
2   20060103         Zola    Emile
3   20060104         Mann   Thomas
4   20060105    Stevenson   Robert
5   20060106  targgeriyan    miles
6   20060107     doubglas    comma
7   20060108        hobbs    tires
8   20060109         shaw    dogma